In [1]:
import pandas as pd

In [2]:
car_data = pd.read_csv('carprices.csv')
home_data = pd.read_csv('homeprices.csv')

In [3]:
home_data.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [4]:
# Dummy variable encoding using pd.get_dummies method.
dummies = pd.get_dummies(home_data.town)

In [5]:
merged = pd.concat([home_data,dummies],axis='columns')

In [6]:
merged.head()

              town  area   price  monroe township  robinsville  west windsor
0  monroe township  2600  550000                1            0             0
1  monroe township  3000  565000                1            0             0
2  monroe township  3200  610000                1            0             0
3  monroe township  3600  680000                1            0             0
4  monroe township  4000  725000                1            0             0

In [7]:
merged.drop(['town','west windsor'],axis='columns',inplace=True)

In [8]:
merged.head()

   area   price  monroe township  robinsville
0  2600  550000                1            0
1  3000  565000                1            0
2  3200  610000                1            0
3  3600  680000                1            0
4  4000  725000                1            0

In [9]:
from sklearn.linear_model import LinearRegression
model = LinearRegression()

In [10]:
X = merged.drop(['price'],axis='columns')
X

    area  monroe township  robinsville
0   2600                1            0
1   3000                1            0
2   3200                1            0
3   3600                1            0
4   4000                1            0
5   2600                0            0
6   2800                0            0
7   3300                0            0
8   3600                0            0
9   2600                0            1
10  2900                0            1
11  3100                0            1
12  3600                0            1

In [11]:
y = merged.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [12]:
model.fit(X,y)

LinearRegression()

In [13]:
model.predict([[2800,0,1]])

array([590775.63964739])